#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖 Success! The configuration is valid.
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
random_string.af-name-noise: Refreshing state... [id=JQ31M]
random_string.af-sa-name-noise: Refreshing state... [id=z4gtem6edd]
random_password.af-sp-random-password: Refreshing state... [id=none]
azuread_application.af-application: Refreshing state... [id=a8010629-0ebd-4f4c-8550-1058f351d3a2]
azuread_service_principal.af-sp: Refreshing state... [id=3a5f7726-9295-4c1e-ad35-ceb2acfba703]
azuread_service_principal_password.af-sp-random-password: Refreshing state... [id=3a5f7726-9295-4c1e-ad35-ceb2acfba703/password/00633a45-9aeb-de34-8796-6f121e9c67f7]
azurerm_resource_group.af-rg: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg]
azurerm_app_service_plan.af-service-plan: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg/providers/Microsoft.Web/serverfarms/continuous-validation-service-plan]
azurerm_storage_account.af-sa: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg/providers/Microsoft.Storage/storageAccounts/cvsaz4gtem6edd]
azurerm_function_app.af: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg/providers/Microsoft.Web/sites/pr-1-continuous-validation-JQ31M]
azurerm_role_assignment.af-sp-role-assignment: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg/providers/Microsoft.Web/sites/pr-1-continuous-validation-JQ31M/providers/Microsoft.Authorization/roleAssignments/d86575f0-91bb-18a6-2a69-cee51e0ef0fe]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_function_app.af must be replaced
-/+ resource "azurerm_function_app" "af" {
      ~ client_affinity_enabled        = false -> (known after apply)
      ~ custom_domain_verification_id  = "BBCBEBEDC9CC07B90BAB0B7B16B5F0B85F00829EEC76431270325414D7DBD6BC" -> (known after apply)
      - daily_memory_time_quota        = 0 -> null
      ~ default_hostname               = "pr-1-continuous-validation-jq31m.azurewebsites.net" -> (known after apply)
      ~ id                             = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg/providers/Microsoft.Web/sites/pr-1-continuous-validation-JQ31M" -> (known after apply)
      ~ kind                           = "functionapp" -> (known after apply)
      ~ name                           = "pr-1-continuous-validation-JQ31M" -> (known after apply) # forces replacement
      ~ outbound_ip_addresses          = "20.67.208.94,20.67.208.114,20.67.208.126,20.67.208.193,20.67.208.195,20.67.208.246" -> (known after apply)
      ~ possible_outbound_ip_addresses = "20.67.208.94,20.67.208.114,20.67.208.126,20.67.208.193,20.67.208.195,20.67.208.246,20.67.209.11,20.67.209.62,20.67.209.131,20.67.209.219,20.67.209.226,20.67.209.246,20.67.209.252,20.67.210.17,20.67.210.35,20.67.210.36,20.67.210.38,20.67.210.53,20.67.210.84,20.67.210.102,20.67.210.108,20.67.210.110,20.67.210.115,20.67.210.119,20.67.210.120,20.67.210.130,20.67.210.136,51.104.153.167,51.104.153.207,51.104.155.180" -> (known after apply)
      ~ site_credential                = [
          - {
              - password = "MfxXqKr1Z8FdYAcFhrp2prF3X8afCsrufKfSfi566RJAcXFJEAgwis1wjWJD"
              - username = "$pr-1-continuous-validation-JQ31M"
            },
        ] -> (known after apply)
      ~ storage_connection_string      = (sensitive value)
      - tags                           = {} -> null
        # (10 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ site_config {
          ~ always_on                   = false -> (known after apply)
          + auto_swap_slot_name         = (known after apply)
          ~ ftps_state                  = "AllAllowed" -> (known after apply)
          + health_check_path           = (known after apply)
          ~ http2_enabled               = false -> (known after apply)
          ~ ip_restriction              = [] -> (known after apply)
          + linux_fx_version            = (known after apply)
          ~ min_tls_version             = "1.2" -> (known after apply)
          ~ pre_warmed_instance_count   = 0 -> (known after apply)
          ~ scm_ip_restriction          = [] -> (known after apply)
          + scm_type                    = (known after apply)
          ~ scm_use_main_ip_restriction = false -> (known after apply)
          ~ use_32_bit_worker_process   = true -> (known after apply)
          ~ websockets_enabled          = false -> (known after apply)

          ~ cors {
              ~ allowed_origins     = [
                  - "https://functions-next.azure.com",
                  - "https://functions-staging.azure.com",
                  - "https://functions.azure.com",
                ] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }
    }

  # azurerm_role_assignment.af-sp-role-assignment must be replaced
-/+ resource "azurerm_role_assignment" "af-sp-role-assignment" {
      ~ id                               = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg/providers/Microsoft.Web/sites/pr-1-continuous-validation-JQ31M/providers/Microsoft.Authorization/roleAssignments/d86575f0-91bb-18a6-2a69-cee51e0ef0fe" -> (known after apply)
      ~ name                             = "d86575f0-91bb-18a6-2a69-cee51e0ef0fe" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ role_definition_name             = "Contributor" -> "contributor"
      ~ scope                            = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg/providers/Microsoft.Web/sites/pr-1-continuous-validation-JQ31M" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # random_string.af-name-noise must be replaced
-/+ resource "random_string" "af-name-noise" {
      ~ id          = "JQ31M" -> (known after apply)
      ~ lower       = false -> true # forces replacement
      ~ result      = "JQ31M" -> (known after apply)
      ~ upper       = true -> false # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ azure-function-name = "pr-1-continuous-validation-JQ31M" -> (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @MartinAnder, Action: `pull_request`, Working Directory: ``, Workflow: `Up`*